#include <cmath>
#include <iostream>
using namespace std;
int main()
{
    cout << "Задание 1, функция 1. Вариант 15" << endl;
    cout << "Введите значение параметра b: ";
    long double b, z1;
    cin >> b;
    z1 = (sqrt(2 * b + 2 * (sqrt(b * b - 4)))) / (sqrt(b * b - 4) + b + 2);
    cout << "Результат работы программы: " << z1 << endl;
    /*==============================================================================================================*/

    cout << "Задание 1, функция 2. Вариант 15" << endl;
    cout << "Введите значение параметра b: ";
    long double b2, z2;
    cin >> b2;
    z2 = 1 / (sqrt(b2 + 2));
    cout << "Результат работы программы: " << z2 << endl;
    return 0;
}